Repository: lukoplt/AI-notebook
Catalog: windows/src/AINotebook.App/Strings/*/Resources.resw
Source language: en_us
Languages: cs_cz

source: Settings
cs_cz: Nastavení

source: Language
cs_cz: Jazyk

source: Version
cs_cz: Verze

source: Notebooks
cs_cz: Poznámkové bloky

source: Sources
cs_cz: Zdroje

source: Notes
cs_cz: Poznámky

source: Transformations
cs_cz: Transformace

source: No notebook selected
cs_cz: Žádný blok není vybrán

source: Create notebook
cs_cz: Vytvořit blok

source: Rename notebook
cs_cz: Přejmenovat blok

source: Delete notebook
cs_cz: Smazat blok

source: Notebook name
cs_cz: Název bloku

# notebookDescription
source: Description (optional)
cs_cz: Popis (volitelný)

source: Cancel
cs_cz: Zrušit

source: Create
cs_cz: Vytvořit

source: Save
cs_cz: Uložit

source: Delete
cs_cz: Smazat

# confirmDeleteNotebook
source: Delete this notebook? This cannot be undone.
cs_cz: Opravdu smazat tento blok? Akci nelze vrátit zpět.

# cannotBeEmpty
source: Name cannot be empty.
cs_cz: Název nesmí být prázdný.

source: Welcome
cs_cz: Vítejte

# welcomeBody
source: AI Notebook keeps everything local. To run AI, we'll use Ollama on your Mac.
cs_cz: AI Notebook udržuje vše lokálně. K AI použijeme Ollamu spuštěnou na vašem Macu.

# continueLabel
source: Continue
cs_cz: Pokračovat

# onboardingDetectTitle
source: Check Ollama
cs_cz: Kontrola Ollamy

# onboardingDetectBody
source: We're looking for a running Ollama on your Mac.
cs_cz: Hledáme spuštěnou Ollamu na vašem Macu.

# onboardingDetectChecking
source: Checking…
cs_cz: Hledám…

# onboardingDetectFound
source: Ollama is running.
cs_cz: Ollama běží.

# openOllamaDownload
source: Open download page
cs_cz: Otevřít stránku ke stažení

# onboardingDetectWaiting
source: Waiting for Ollama to start…
cs_cz: Čekám, až se Ollama spustí…

# onboardingPickModelsTitle
source: Pick models
cs_cz: Vyberte modely

# onboardingPickModelsBody
source: Defaults are fine for most people. You can change them later in Settings.
cs_cz: Výchozí hodnoty vyhovují většině uživatelů. Změnit je můžete později v Nastavení.

source: Chat model
cs_cz: Model pro chat

source: Embedding model
cs_cz: Model pro embeddingy

# onboardingPullTitle
source: Downloading models
cs_cz: Stahuji modely

# onboardingPullBody
source: This is a one-time download. Keep the app open.
cs_cz: Tohle je jednorázové stažení. Nechte aplikaci spuštěnou.

# onboardingPullingChat
source: Chat model
cs_cz: Model pro chat

# onboardingPullingEmbedding
source: Embedding model
cs_cz: Model pro embeddingy

# onboardingDoneTitle
source: All set
cs_cz: Hotovo

# onboardingDoneBody
source: You can now create your first notebook.
cs_cz: Teď můžete vytvořit svůj první poznámkový blok.

# ollamaUnreachable
source: Cannot reach Ollama. Is it running?
cs_cz: Nelze se připojit k Ollamě. Je spuštěná?

# startUsingApp
source: Start using the app
cs_cz: Začít používat aplikaci

# sourcesSectionTitle
source: Sources
cs_cz: Zdroje

# addSourceButton
source: Add source
cs_cz: Přidat zdroj

# addSourceSheetTitle
source: Add a source
cs_cz: Přidat zdroj

# addSourceFromFile
source: From file…
cs_cz: Ze souboru…

# addSourceFromURL
source: From URL
cs_cz: Z URL adresy

# addSourceFromText
source: Paste text
cs_cz: Vložit text

# addSourceURLPlaceholder
source: https://example.com/article
cs_cz: https://example.com/clanek

# addSourceTitlePlaceholder
source: Title
cs_cz: Název

# addSourceTextPlaceholder
source: Paste content here
cs_cz: Vložte obsah sem

# addSourceConfirm
source: Add
cs_cz: Přidat

# cancelButton
source: Cancel
cs_cz: Zrušit

# sourceStatusPending
source: Pending
cs_cz: Čeká

# sourceStatusChunking
source: Processing
cs_cz: Zpracovává se

# sourceStatusReady
source: Ready
cs_cz: Hotovo

# sourceStatusError
source: Error
cs_cz: Chyba

# noSourcesEmptyState
source: No sources yet. Add one to get started.
cs_cz: Zatím žádné zdroje. Přidejte první, abyste mohli začít.

# deleteSourceConfirm
source: Delete this source?
cs_cz: Smazat tento zdroj?

# deleteButton
source: Delete
cs_cz: Smazat

# indexingInProgress
source: Indexing {0}…
cs_cz: Indexuji {0}…

# indexingProgressFormat
source: {0} / {1} chunks
cs_cz: {0} / {1} částí

# indexingComplete
source: Indexed
cs_cz: Indexováno

source: Indexing error
cs_cz: Chyba při indexaci

source: Indexing paused
cs_cz: Indexace pozastavena

# indexingIdle
source: Idle
cs_cz: Nečinné

# chatNewSessionTitle
source: New chat
cs_cz: Nový chat

# chatInputPlaceholder
source: Ask anything about your sources…
cs_cz: Zeptej se na cokoli ze svých zdrojů…

# chatSendButton
source: Send
cs_cz: Odeslat

# chatEmptyState
source: Start by asking a question.
cs_cz: Začněte položením otázky.

# chatErrorPrefix
source: Chat error:
cs_cz: Chyba chatu:

# chatCitationsSectionTitle
source: Citations
cs_cz: Citace

# chatNoCitationsForMessage
source: No citations
cs_cz: Žádné citace

# chatRegenerateButton
source: Regenerate
cs_cz: Znovu vygenerovat

# chatSessionsLabel
source: Sessions
cs_cz: Konverzace

# chatNewSessionButton
source: New session
cs_cz: Nová konverzace

# chatDeleteSessionButton
source: Delete session
cs_cz: Smazat konverzaci

# chatSaveAsNoteButton
source: Save as note
cs_cz: Uložit jako poznámku

# notesSectionTitle
source: Notes
cs_cz: Poznámky

# notesEmptyState
source: No notes yet. Create one or save from chat.
cs_cz: Zatím žádné poznámky. Vytvořte ji nebo uložte z chatu.

# notesNewButton
source: New note
cs_cz: Nová poznámka

# noteUntitled
source: Untitled
cs_cz: Bez názvu

# noteTitlePlaceholder
source: Title
cs_cz: Název

# noteBodyPlaceholder
source: Write Markdown here…
cs_cz: Zde pište Markdown…

# noteOriginManual
source: Manual
cs_cz: Ruční

# noteOriginChat
source: From chat
cs_cz: Z chatu

# noteOriginTransformation
source: From transformation
cs_cz: Z transformace

# transformationsSectionTitle
source: Transformations
cs_cz: Transformace

# transformationPickerLabel
source: Transformation
cs_cz: Transformace

# transformationSourcePickerLabel
source: Source
cs_cz: Zdroj

# transformationRunButton
source: Run
cs_cz: Spustit

# transformationResultTitle
source: Result
cs_cz: Výsledek

# transformationRunningStatus
source: Running…
cs_cz: Probíhá…

# transformationEditButton
source: Edit templates
cs_cz: Upravit šablony

# transformationEditorTitle
source: Custom transformations
cs_cz: Vlastní transformace

# transformationEditorNew
source: New
cs_cz: Nový

# transformationEditorDelete
source: Delete
cs_cz: Smazat

# transformationEditorNamePlaceholder
source: Template name
cs_cz: Název šablony

# transformationEditorTemplatePlaceholder
source: Prompt template (use {{source_text}})
cs_cz: Šablona promptu (použijte {{source_text}})

# reembedButton
source: Re-embed all sources
cs_cz: Přeindexovat všechny zdroje

# reembedConfirm
source: This deletes existing embeddings and re-runs them with the current model. Continue?
cs_cz: Smaže stávající vektory a přepočte je aktuálním modelem. Pokračovat?

# reembedConfirmYes
source: Re-embed
cs_cz: Přeindexovat

# embeddingSectionTitle
source: Embedding
cs_cz: Vektorizace

# currentModelLabel
source: Current model
cs_cz: Aktuální model

# manageModelsButton
source: Manage models…
cs_cz: Spravovat modely…

# manageModelsTitle
source: Installed Ollama models
cs_cz: Nainstalované Ollama modely

# manageModelsPullPlaceholder
source: Pull model name (e.g. mistral:7b)
cs_cz: Stáhnout model (např. mistral:7b)

# manageModelsPullButton
source: Pull
cs_cz: Stáhnout

# manageModelsRefreshButton
source: Refresh list
cs_cz: Obnovit seznam

# chatModelPickerLabel
source: Chat model
cs_cz: Chatovací model

# embeddingModelPickerLabel
source: Embedding model
cs_cz: Model pro vektorizaci

# openNoteFromCitation
source: Open note
cs_cz: Otevřít poznámku

# notesChatPanelEmpty
source: Start a question about this notebook…
cs_cz: Zeptej se na něco z tohoto notebooku…

# notesChatCurrentNoteHint
source: Including the open note as bonus context
cs_cz: Aktuální poznámka přidána jako kontext

# editorStatusSaved
source: Saved
cs_cz: Uloženo

# editorStatusSaving
source: Saving…
cs_cz: Ukládám…

# editorStatusUnsaved
source: Unsaved changes
cs_cz: Neuložené změny

# editorStatusError
source: Save failed
cs_cz: Uložení selhalo

# editorFailedToLoad
source: Editor failed to load. Reopen the note.
cs_cz: Editor se nepodařilo načíst. Otevřete poznámku znovu.

# attachmentBrokenLink
source: Attachment missing
cs_cz: Příloha chybí

# attachmentSaveFailed
source: Couldn't save attachment
cs_cz: Nepodařilo se uložit přílohu

# attachmentOpenButton
source: Open
cs_cz: Otevřít

# historyButton
source: History
cs_cz: Historie

# historySheetTitle
source: Version history
cs_cz: Historie verzí

# historyEmpty
source: No earlier versions yet.
cs_cz: Žádné dřívější verze.

# historyRestoreButton
source: Restore this version
cs_cz: Obnovit tuto verzi

# historyReasonAutosave
source: Auto-save
cs_cz: Auto-uložení

# historyReasonRestore
source: Restored
cs_cz: Obnoveno

# aiToolsSectionTitle
source: AI tools
cs_cz: AI nástroje

# aiToolsEmptyTitle
source: What are AI tools?
cs_cz: Co jsou AI nástroje?

# aiToolsEmptyBody
source: Pick a template, pick a source, click Run. The output is saved as a new note in this notebook.
cs_cz: Vyber šablonu, vyber zdroj, klikni Spustit. Výstup se uloží jako nová poznámka v tomto notebooku.

# aiToolsScopeAllSources
source: All sources
cs_cz: Všechny zdroje

# aiToolsScopeHint
source: Source = one item · Notebook = combined · All sources = one note per source
cs_cz: Zdroj = jedna položka · Notebook = vše dohromady · Všechny zdroje = poznámka na každý zdroj

# aiToolsPreviewButton
source: Preview prompt
cs_cz: Náhled promptu

# aiToolsHistoryButton
source: History
cs_cz: Historie

# aiToolsResultSavedFormat
source: Saved as note: {0}
cs_cz: Uloženo jako poznámka: {0}

# aiToolsOpenNoteButton
source: Open note
cs_cz: Otevřít poznámku

# aiToolsRunningFormat
source: Running {0} / {1}…
cs_cz: Probíhá {0} / {1}…

# aiToolsBatchSavedFormat
source: Saved {0} notes
cs_cz: Uloženo {0} poznámek

# aiToolsPromptPreviewTitle
source: Prompt preview
cs_cz: Náhled promptu

# aiToolsHistoryEmpty
source: No runs yet.
cs_cz: Zatím žádné spuštění.

# aiToolsHistoryTitle
source: Run history
cs_cz: Historie spuštění

# aiToolsDescriptionPlaceholder
source: Short description (shown under the template name)
cs_cz: Krátký popis (zobrazí se pod názvem šablony)

# unsavedChangesTitle
source: Unsaved changes
cs_cz: Neuložené změny

# unsavedChangesMessage
source: This note has unsaved edits. Save them before switching?
cs_cz: Tato poznámka má neuložené úpravy. Uložit před přepnutím?

# unsavedSaveButton
source: Save
cs_cz: Uložit

# unsavedDiscardButton
source: Discard
cs_cz: Zahodit

# chatFollowupsLabel
source: Suggested follow-ups
cs_cz: Návrhy navazujících otázek

# sourceSummaryLabel
source: Summary
cs_cz: Shrnutí

# sourceSummarizeButton
source: Summarize
cs_cz: Shrnout

# sourceSummarizingStatus
source: Summarizing…
cs_cz: Shrnuji…

# chatScopeButton
source: Sources
cs_cz: Zdroje

# chatScopeAllSources
source: All sources
cs_cz: Všechny zdroje

# chatScopeTitle
source: Limit chat to sources
cs_cz: Omezit chat na zdroje
